OpenFOAM-6-cantera/tutorials/compressible/rhoPorousSimpleFoam/angledDuctImplicit/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

source1
{
    type            fixedTemperatureConstraint;

    selectionMode   cellZone;
    cellZone        porosity;

    mode            uniform;
    temperature     350;
}


// ************************************************************************* //
